## ✅ `tofu apply` output
```module.function.data.archive_file.source_code: Reading...
module.function.data.archive_file.source_code: Read complete after 0s [id=205a49cd14c3222877713d5bd400ad13fe251a9d]
module.function.data.aws_iam_policy_document.policy: Reading...
module.function.data.aws_iam_policy_document.allow_logging: Reading...
module.gateway.aws_apigatewayv2_api.api: Refreshing state... [id=jom8qd5201]
module.function.data.aws_iam_policy_document.allow_logging: Read complete after 0s [id=16712114]
module.function.data.aws_iam_policy_document.policy: Read complete after 0s [id=2690255455]
module.function.aws_iam_role.lambda: Refreshing state... [id=lambda-sample]
module.gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.function.aws_lambda_function.function: Refreshing state... [id=lambda-sample]
module.gateway.aws_lambda_permission.allow_invoke["GET /"]: Refreshing state... [id=AllowAPIGatewayToCallSampleAppLambda]
module.gateway.aws_apigatewayv2_integration.lambda: Refreshing state... [id=83gm6y4]
module.gateway.aws_apigatewayv2_route.lambda_route["GET /"]: Refreshing state... [id=6ejfefr]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # module.function.aws_iam_role_policy.allow_logging will be created
  + resource "aws_iam_role_policy" "allow_logging" {
      + id          = (known after apply)
      + name        = "lambda-sample-allow-logging"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "lambda-sample"
    }

  # module.function.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "lambda-sample"
      ~ last_modified                  = "2025-02-03T13:57:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "yw0UQH6S0oHodMG7Oj1l8p3oKAV/M1yw/5NsQ2TKuG0=" -> "ZHzvt00oIU011ndP5l5YXqipBi+r/JcF8pv9gikByT4="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
module.function.aws_iam_role_policy.allow_logging: Creating...
module.function.aws_lambda_function.function: Modifying... [id=lambda-sample]
module.function.aws_iam_role_policy.allow_logging: Creation complete after 0s [id=lambda-sample:lambda-sample-allow-logging]
module.function.aws_lambda_function.function: Modifications complete after 5s [id=lambda-sample]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.

Outputs:

api_endpoint = "https://jom8qd5201.execute-api.us-east-2.amazonaws.com"
`